Large/C2/ab-raw.log
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking apps2.abzi.co (be patient)


Server Software:        nginx/1.10.3
Server Hostname:        <redacted>
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
TLS Server Name:        <redacted>

Document Path:          <redacted>
Document Length:        683479 bytes

Concurrency Level:      2
Time taken for tests:   61.433 seconds
Complete requests:      56
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      38809360 bytes
HTML transferred:       38798929 bytes
Requests per second:    0.91 [#/sec] (mean)
Time per request:       2194.049 [ms] (mean)
Time per request:       1097.025 [ms] (mean, across all concurrent requests)
Transfer rate:          616.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       55   84  64.1     63     425
Processing:   794 2077 600.0   2050    3383
Waiting:       48   96 137.2     54     969
Total:       1031 2160 594.8   2107    3441

Percentage of the requests served within a certain time (ms)
  50%   2107
  66%   2414
  75%   2582
  80%   2724
  90%   2929
  95%   3221
  98%   3433
  99%   3441
 100%   3441 (longest request)